---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CouplerLength
source: html/9052562f-b031-cd92-c84b-8dfd14a63c0d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CouplerLength Property

"Total Length"

## Syntax (C#)
```csharp
public static ForgeTypeId CouplerLength { get; }
```